# GetFamilySizeTableManager Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FamilySizeTableManager..::..GetFamilySizeTableManager Method
FamilySizeTableManager Class See Also
---
Gets a FamilySizeTableManager from a Family
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public static FamilySizeTableManager GetFamilySizeTableManager(
	Document document,
	ElementId familyId
)
```

Visual Basic
---
```text
Public Shared Function GetFamilySizeTableManager ( _
	document As Document, _
	familyId As ElementId _
) As FamilySizeTableManager
```

Visual C++
---
```text
public:
static FamilySizeTableManager^ GetFamilySizeTableManager(
	Document^ document,
	ElementId^ familyId
)
```

# ### Parameters
document
    Type: Autodesk.Revit.DB..::..Document Family owned document or a project document
familyId
    Type: Autodesk.Revit.DB..::..ElementId ElementId of the Family.
# ### Return Value
The FamilySizeTableManager of the Family.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
FamilySizeTableManager Class
Autodesk.Revit.DB Namespace